[ShockAmmo X2WeaponTemplate]
FriendlyName="Shock Ammo"
BriefSummary="Adds an ability that removes an action point from the enemy target's next turn. Also has a chance to disable the enemy's ranged weapon."
TacticalText="<Bullet/> Crippled enemies buys more time for XCOM soldiers to survive or kill"

[ShockAmmoAbility X2AbilityTemplate]
LocFriendlyName="Shock Ammo"
LocLongDescription="Target is stunned and loses an action point on their next turn. Also a chance to drain all the target's ammo."
LocHelpText="Target is stunned and loses an action point on their next turn. Also a chance to drain all the target's ammo."
LocFlyOverText="Shock Ammo"
LocPromotionPopupText="<Bullet/> Shock Ammo has a <Ability:SelfCooldown/> turn cooldown.<br/>"


